# Advanced SQL I and II Review Session Questions

#### By: Boom (DSI-NYC), Mahdi S. (DSI-NYC)

### Step #1 - create the `employees` table
Within this repo is a `employees.txt` file, which contains the SQL code to create the `employees` table and populate it with data

### Step #2 - Answer the following questions

### 1) Write a query that returns two columns: (i) the e-mail addresses but only for those that end in '.edu' and (ii) an indication of whether or not the employee works in the Games, Phones & Tablets, Toys department.

```sql
SELECT e.email, e.department IN ('Games', 'Phones & Tablets', 'Toys') 
FROM employees AS e
WHERE e.email LIKE '%.edu'
```

### 2) Write a query that shows the first name (in all lower case), the last name (in all upper case), and email for all people who work in region_id = 1. However, if an e-mail is missing, replace it with the string 'Not available'.

```sql
SELECT LOWER(e.first_name), UPPER(e.last_name), COALESCE(email, 'Not available')
FROM employees AS e
WHERE e.region_id = 1
```

### 3) Write a query that combines first name and last name of each female employee into a single column, and categorizes them into 'High Tier' salary (>100,000), 'Middle Tier' salary (b/w 70,000 - 100,000), 'Low Tier' salary (<70,000).

```sql
SELECT e.first_name || ' ' || e.last_name AS full_name,
	CASE
		WHEN salary > 100000 THEN 'High Tier'
		WHEN salary BETWEEN 70000 AND 100000 THEN 'Middle Tier'
		ELSE 'Low Tier'
	END AS tier
FROM employees AS e
WHERE e.gender = 'F'
```

### 4) Write a query that finds all employees who work in the United States and Canada who were hired in the year 2013.

```sql
SELECT *
FROM employees AS e
JOIN regions AS r ON e.region_id = r.region_id
WHERE r.country IN ('Canada', 'United States') AND EXTRACT(year FROM e.hire_date) = 2013
```

### 5) Write a query that returns the most common first name(s) in the company. You need to account for ties, so you should not be using ORDER BY and LIMIT 1 here.

```sql
SELECT e.first_name, COUNT(*) AS total
FROM employees AS e
GROUP BY e.first_name
HAVING COUNT(e.employee_id) >= ALL(SELECT COUNT(*)
								   FROM employees
								   GROUP BY first_name)
```

### 6) Write a SQL query that returns the first name and email of all employees who have the SECOND HIGHEST salary in the company.

```sql
SELECT e.first_name, e.email
FROM employees AS e
WHERE e.salary = (
	SELECT emp.salary
	FROM employees AS emp
	ORDER BY salary DESC
	LIMIT 1 OFFSET 1
)
```

### 7) Write a query that gives the mean salary of all employees that were hired in March of any given year.

```sql
SELECT EXTRACT(year FROM e.hire_date) AS year, ROUND(AVG(e.salary), 2) AS march_hires_avg_salary
FROM employees AS e
WHERE EXTRACT(month FROM e.hire_date) = 3
GROUP BY EXTRACT(year FROM e.hire_date)
ORDER BY year DESC
```